# Group By

In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {'Company':['Google','Google','Microsoft','Microsoft','Facebook','Facebook'],
    'Person': ['Asif','Sahil','Asif','Sahil','Asif','Sahil'],
     'sales':[100,200,354,485,259,625]
    }

In [4]:
df = pd.DataFrame(data)

In [5]:
df

     Company Person  sales
0     Google   Asif    100
1     Google  Sahil    200
2  Microsoft   Asif    354
3  Microsoft  Sahil    485
4   Facebook   Asif    259
5   Facebook  Sahil    625

In [6]:
#group by method dia jei row er name dibo oita k group kore dibe

In [7]:
byCompany = df.groupby('Company')

In [8]:
byCompany

In [9]:
byCompany.mean()

           sales
Company
Facebook   442.0
Google     150.0
Microsoft  419.5

In [10]:
byCompany.sum()

           sales
Company
Facebook     884
Google       300
Microsoft    839

In [11]:
byCompany.std()

                sales
Company
Facebook   258.801082
Google      70.710678
Microsoft   92.630988

In [13]:
byCompany.sum().loc['Facebook']

sales    884
Name: Facebook, dtype: int64

In [14]:
# one line code

In [16]:
df.groupby('Company').sum().loc["Facebook"]

sales    884
Name: Facebook, dtype: int64

In [17]:
df.groupby('Company').max()

          Person  sales
Company
Facebook   Sahil    625
Google     Sahil    200
Microsoft  Sahil    485

In [18]:
df.groupby('Company').min()

          Person  sales
Company
Facebook    Asif    259
Google      Asif    100
Microsoft   Asif    354

In [19]:
#all in one

In [20]:
df.groupby("Company").describe()

          sales
          count   mean         std    min     25%    50%     75%    max
Company
Facebook    2.0  442.0  258.801082  259.0  350.50  442.0  533.50  625.0
Google      2.0  150.0   70.710678  100.0  125.00  150.0  175.00  200.0
Microsoft   2.0  419.5   92.630988  354.0  386.75  419.5  452.25  485.0

In [21]:
df.groupby("Company").describe().transpose()

Company        Facebook      Google   Microsoft
sales count    2.000000    2.000000    2.000000
      mean   442.000000  150.000000  419.500000
      std    258.801082   70.710678   92.630988
      min    259.000000  100.000000  354.000000
      25%    350.500000  125.000000  386.750000
      50%    442.000000  150.000000  419.500000
      75%    533.500000  175.000000  452.250000
      max    625.000000  200.000000  485.000000

In [22]:
df.groupby("Company").describe().transpose()['Facebook']

sales  count      2.000000
       mean     442.000000
       std      258.801082
       min      259.000000
       25%      350.500000
       50%      442.000000
       75%      533.500000
       max      625.000000
Name: Facebook, dtype: float64